"""
该文件介绍将会介绍 python 中的容器及其常用方法。
容器介绍包含： dict, list
"""

"""
=====================
        dict
=====================
"""

# dict 是 python 中的字典，用于存放键值对。下面介绍常用方法。

"""
------------------------------------------------------------------------------------
方法： dict.items()
return: 可迭代的视图对象(dict_items),这个对象包含了字典中所有的键值对，每个键值对以 (键, 值) 的元组形式呈现。
------------------------------------------------------------------------------------
"""

# 1、常用场景：遍历字典所有键值对
student_scores = {
    "小明": 95,
    "小红": 98,
    "小刚": 89
}
print("\n遍历所有键值对：")
for name, score in student_scores.items():
    print(f"{name} 的分数是: {score}")

# 2、也可以将 dict_items 转换为列表（方便索引、切片等操作）
items_list = list(student_scores.items())